//
//  Basescene.cpp
//  kokkaku
//
//  Created by 小池潤 on 2019/05/11.
//

#include "Basescene.hpp"

//--------------------------------------------------------------
//void Basescene::setup(){
//
//}
//
////--------------------------------------------------------------
//void Basescene::update(){
//
//}
//
////--------------------------------------------------------------
//void Basescene::draw(){
//
//}
//
////--------------------------------------------------------------
//void Basescene::keyPressed(int key){
//
//}
//
////--------------------------------------------------------------
//void Basescene::keyReleased(int key){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mouseMoved(int x, int y){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mouseDragged(int x, int y, int button){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mousePressed(int x, int y, int button){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mouseReleased(int x, int y, int button){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mouseEntered(int x, int y){
//
//}
//
////--------------------------------------------------------------
//void Basescene::mouseExited(int x, int y){
//
//}
//
////--------------------------------------------------------------
//void Basescene::windowResized(int w, int h){
//
//}
//
////--------------------------------------------------------------
//void Basescene::gotMessage(ofMessage msg){
//
//}
//
////--------------------------------------------------------------
//void Basescene::dragEvent(ofDragInfo dragInfo){
//
//}
